Revit 2024 API
FailuresProcessingEventArgs Members
The FailuresProcessingEventArgs type exposes the following members.
Methods
Name | Description
Dispose |  (Inherited from RevitAPIEventArgs.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetFailuresAccessor
 Provides access to the failure information in the document.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetProcessingResult
 Retrieves current status of the failures processing result.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsCancelled
 Indicates whether the event is being cancelled.
 (Inherited from RevitAPIEventArgs.)
SetProcessingResult
 Sets the result of the failures processing accomplished during this event callback.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
Cancellable
 Indicates whether an event may be cancelled by an event delegate.
 (Inherited from RevitAPIEventArgs.)
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from RevitAPIEventArgs.)
See Also
FailuresProcessingEventArgs Class
Autodesk.Revit.DB.Events Namespace